# Pandas

In [1]:
import pandas as pd

* series ---- 1d array
* data frame ---- 2d array(table format,row & col)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\91831\AppData\Local\Temp\ipykernel_6200\1746593775.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))

<class 'pandas.core.series.Series'>

In [4]:
print(type(b))

<class 'pandas.core.series.Series'>

In [5]:
a

Series([], dtype: float64)

In [6]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [7]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [8]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [9]:
import numpy as np

In [10]:
n=np.array([1,2,3,4,65])

In [11]:
x=pd.Series(n)

In [12]:
x

0     1
1     2
2     3
3     4
4    65
dtype: int32

In [13]:
type(x)

pandas.core.series.Series

In [14]:
b=pd.Series([1,2,[12,10],33,[12,23],35,32,24,24])

In [15]:
b

0           1
1           2
2    [12, 10]
3          33
4    [12, 23]
5          35
6          32
7          24
8          24
dtype: object

In [16]:
type(b)

pandas.core.series.Series

In [17]:
b[0]

1

In [18]:
b[3:7]

3          33
4    [12, 23]
5          35
6          32
dtype: object

In [19]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [20]:
d[3:]

d    99
dtype: int64

In [21]:
d[3:4]

d    99
dtype: int64

In [22]:
d['d']

99

In [23]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [24]:
s=pd.Series([23,32,2,4,54,22],index=['a','s','d','f','g','h'])

In [25]:
s

a    23
s    32
d     2
f     4
g    54
h    22
dtype: int64

In [26]:
s1=pd.Series([23,32,2,4,54,22],index=list('asdfgh'))

In [27]:
s1

a    23
s    32
d     2
f     4
g    54
h    22
dtype: int64

In [28]:
s2=pd.Series([23,32,2,4,54,22,22,2,4,23,4,4,4,4,32])

In [29]:
s2

0     23
1     32
2      2
3      4
4     54
5     22
6     22
7      2
8      4
9     23
10     4
11     4
12     4
13     4
14    32
dtype: int64

In [30]:
s2.value_counts()

4     6
23    2
32    2
2     2
22    2
54    1
dtype: int64

In [31]:
s2.max()

54

In [32]:
s2.min()

2

In [33]:
s2.argmax()

4

In [34]:
s2.argmin()

2

In [35]:
s1.idxmax()

'g'

In [36]:
s1

a    23
s    32
d     2
f     4
g    54
h    22
dtype: int64

In [37]:
s1.idxmin()

'd'

# DataFrame

In [38]:
a=pd.DataFrame()
b=pd.DataFrame([4,242,425,56,6,])

In [39]:
a

Empty DataFrame
Columns: []
Index: []

In [40]:
b

     0
0    4
1  242
2  425
3   56
4    6

In [41]:
type(b)

pandas.core.frame.DataFrame

In [42]:
c=pd.DataFrame([[4,242,425,56,6,],[2,3,4,5,35],[34,35,4,3,2],[32,2,4,5,6],[3,5,6,74,3],[21,31,3,4,5]])

In [43]:
c

    0    1    2   3   4
0   4  242  425  56   6
1   2    3    4   5  35
2  34   35    4   3   2
3  32    2    4   5   6
4   3    5    6  74   3
5  21   31    3   4   5

In [44]:
c

    0    1    2   3   4
0   4  242  425  56   6
1   2    3    4   5  35
2  34   35    4   3   2
3  32    2    4   5   6
4   3    5    6  74   3
5  21   31    3   4   5

In [45]:
c.head()              # print first five row

    0    1    2   3   4
0   4  242  425  56   6
1   2    3    4   5  35
2  34   35    4   3   2
3  32    2    4   5   6
4   3    5    6  74   3

In [46]:
c.tail()  #print last five

    0   1  2   3   4
1   2   3  4   5  35
2  34  35  4   3   2
3  32   2  4   5   6
4   3   5  6  74   3
5  21  31  3   4   5

In [47]:
c.head(3)

    0    1    2   3   4
0   4  242  425  56   6
1   2    3    4   5  35
2  34   35    4   3   2

In [48]:
c.sample(4)

    0    1    2   3   4
2  34   35    4   3   2
1   2    3    4   5  35
4   3    5    6  74   3
0   4  242  425  56   6

In [49]:
c.sample()

   0    1    2   3  4
0  4  242  425  56  6

In [50]:
d=pd.DataFrame([[4,242,6],[2,3,np.nan,5,'Missing'],[34,35,4],[3,2],[32,2,4,5,6],[3,5,6,74,3],[21,31,3,4,5]])

In [51]:
d

    0    1    2     3        4
0   4  242  6.0   NaN     None
1   2    3  NaN   5.0  Missing
2  34   35  4.0   NaN     None
3   3    2  NaN   NaN     None
4  32    2  4.0   5.0        6
5   3    5  6.0  74.0        3
6  21   31  3.0   4.0        5

In [52]:
d

    0    1    2     3        4
0   4  242  6.0   NaN     None
1   2    3  NaN   5.0  Missing
2  34   35  4.0   NaN     None
3   3    2  NaN   NaN     None
4  32    2  4.0   5.0        6
5   3    5  6.0  74.0        3
6  21   31  3.0   4.0        5

In [53]:
e=pd.DataFrame([[4,242,6],[2,3,np.nan,5,'Missing'],[34,35,4],[3,2],[32,2,4,5,6],[3,5,6,74,3],[21,31,3,4,5]],columns=['name','mark','class','ph no','age'])

In [54]:
e

   name  mark  class  ph no      age
0     4   242    6.0    NaN     None
1     2     3    NaN    5.0  Missing
2    34    35    4.0    NaN     None
3     3     2    NaN    NaN     None
4    32     2    4.0    5.0        6
5     3     5    6.0   74.0        3
6    21    31    3.0    4.0        5

In [55]:
e['age']

0       None
1    Missing
2       None
3       None
4          6
5          3
6          5
Name: age, dtype: object

In [56]:
e[['class','age']]

   class      age
0    6.0     None
1    NaN  Missing
2    4.0     None
3    NaN     None
4    4.0        6
5    6.0        3
6    3.0        5

In [57]:
e[['class','age']]

   class      age
0    6.0     None
1    NaN  Missing
2    4.0     None
3    NaN     None
4    4.0        6
5    6.0        3
6    3.0        5

In [58]:
e[['class','age']].head(3)

   class      age
0    6.0     None
1    NaN  Missing
2    4.0     None

In [59]:
e[['class','age']][1:4]

   class      age
1    NaN  Missing
2    4.0     None
3    NaN     None

In [60]:
e.shape

(7, 5)

In [61]:
e['class']

0    6.0
1    NaN
2    4.0
3    NaN
4    4.0
5    6.0
6    3.0
Name: class, dtype: float64

In [62]:
e['class'].argmax()

0

In [63]:
e['class'].max()

6.0

In [64]:
e['new_col']=[23,76,8,65,9,8,9]

In [65]:
e

   name  mark  class  ph no      age  new_col
0     4   242    6.0    NaN     None       23
1     2     3    NaN    5.0  Missing       76
2    34    35    4.0    NaN     None        8
3     3     2    NaN    NaN     None       65
4    32     2    4.0    5.0        6        9
5     3     5    6.0   74.0        3        8
6    21    31    3.0    4.0        5        9

In [66]:
e['new_col2']=[23,76,89,65,97,88,9]

In [67]:
e

   name  mark  class  ph no      age  new_col  new_col2
0     4   242    6.0    NaN     None       23        23
1     2     3    NaN    5.0  Missing       76        76
2    34    35    4.0    NaN     None        8        89
3     3     2    NaN    NaN     None       65        65
4    32     2    4.0    5.0        6        9        97
5     3     5    6.0   74.0        3        8        88
6    21    31    3.0    4.0        5        9         9

In [68]:
e['new_col3']=e['new_col']+e['new_col2']

In [69]:
e

   name  mark  class  ph no      age  new_col  new_col2  new_col3
0     4   242    6.0    NaN     None       23        23        46
1     2     3    NaN    5.0  Missing       76        76       152
2    34    35    4.0    NaN     None        8        89        97
3     3     2    NaN    NaN     None       65        65       130
4    32     2    4.0    5.0        6        9        97       106
5     3     5    6.0   74.0        3        8        88        96
6    21    31    3.0    4.0        5        9         9        18

In [70]:
f=e['mark']>26

In [71]:
e[f]

   name  mark  class  ph no   age  new_col  new_col2  new_col3
0     4   242    6.0    NaN  None       23        23        46
2    34    35    4.0    NaN  None        8        89        97
6    21    31    3.0    4.0     5        9         9        18